## 1. 판다스 데이터구조

## 2. 시리즈와 데이터프레임

### 시리즈

In [1]:
#라이브러리 불러오기
import pandas as pd
sd1 = pd.Series(['Dog','Cat','Tiger','Lion','Monkey'],index=['0','1', '2','3','4']) 

#시리즈데이터 출력
sd1

0       Dog
1       Cat
2     Tiger
3      Lion
4    Monkey
dtype: object

### 시리즈 - 1) 딕셔너리

In [2]:
import pandas as pd
#딕셔너리로 Series 생성
dict_data = {'a':1,'b':2,'c':3}
sd2 = pd.Series(dict_data)

#타입 확인
type(sd2)

sd2

a    1
b    2
c    3
dtype: int64

### 시리즈 - 2) 리스트

In [3]:
import pandas as pd

#리스트로 Series 생성
list_data = ['Dog','Cat','Tiger','Lion','Monkey']
pd3 = pd.Series(list_data,index = ['0','1', '2','3','4']) 

#데이터 확인
print(type(pd3))
print(pd3)

<class 'pandas.core.series.Series'>
0       Dog
1       Cat
2     Tiger
3      Lion
4    Monkey
dtype: object

### 시리즈 - 3) 튜플

In [4]:
import pandas as pd
#튜플로 Series 생성
tup_data = ('이순신','1991-03-15','남')
sd4 = pd.Series(tup_data, index = ['이름','생년월일','성별'])

#데이터 확인
sd4.info()

<class 'pandas.core.series.Series'>
Index: 3 entries, 이름 to 성별
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      object
dtypes: object(1)
memory usage: 48.0+ bytes

### 데이터프레임

### 데이터프레임- 1) 딕셔너리

In [5]:
#라이브러리 불러오기
import pandas as pd

#딕셔너리로로 데이터프레임 생성
dict_data = {'동물':['Dog','Cat','Tiger','Lion','Monkey'],'나이':[7,9,2,3,1]}
df1 = pd.DataFrame(dict_data)

#타입 확인
print(type(df1))

#데이터 확인
print(df1)

<class 'pandas.core.frame.DataFrame'>
       동물  나이
0     Dog   7
1     Cat   9
2   Tiger   2
3    Lion   3
4  Monkey   1

### 데이터프레임 - 2) 리스트

In [6]:
#라이브러리 불러오기
import pandas as pd

#리스트로 데이터프레임 생성
df2 = pd.DataFrame([['Dog','7'], ['Cat','9'], ['Tiger','2'], ['Lion','3'],['Monkey','1']],
                  index = ['0','1','2','3','4'],
                  columns = ['동물','나이'])

#타입 확인
print(type(df2))
#데이터 확인
print(df2)

<class 'pandas.core.frame.DataFrame'>
       동물 나이
0     Dog  7
1     Cat  9
2   Tiger  2
3    Lion  3
4  Monkey  1

## 3. 데이터프레임 조작

### 1) 데이터 요약 보기

In [8]:
# 관련 라이브러리 불러오기
import pandas as pd           #판다스
import seaborn as sns          #시본 

#데이터 준비 시본에 내장된 팁 데이터 
tips = sns.load_dataset("tips")    # 팁 데이터
print(type(tips))
tips

Matplotlib is building the font cache; this may take a moment.

<class 'pandas.core.frame.DataFrame'>

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [9]:
tips.info() #데이터 프레임으로 되어 있으니 info()fmf 쓴다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

#### 2) 행 상하위 데이터 추출

In [10]:
#데이터프레임에서 BM' 열의 상위 5개 데이터 추출
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
#데이터프레임에서 BM' 열의 상위 2개 데이터 추출
tips.head(2)

In [11]:
#데이터프레임에서 열의 하위 데이터 추출
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [ ]:
#데이터프레임에서 BMI '' 열의 하위 3개 데이터 추출
tips.tail(3)

### 행 데이터

#### loc와 iloc 인덱스와 행번호란?

In [13]:
tips1 = tips.drop([2]) 
tips1

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
5         25.29  4.71    Male     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[243 rows x 7 columns]

In [14]:
tips1.iloc[2]

total_bill     23.68
tip             3.31
sex             Male
smoker            No
day              Sun
time          Dinner
size               2
Name: 3, dtype: object

In [ ]:
tips1.loc[2]

In [15]:
#데이터프레임의 기본 정보 확인 
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

#### 1) 인덱스 읽기

In [ ]:
#데이터프레임에서 프레임에서 인덱스가 0인 데이터 추출 
tips.loc[0] # 변수 = tips.loc[]이렇게도 사용할 수 있는데 이건 코드의 명확성과 재사용성(중복 코드 방지)을 위해 이렇게 할 수도 있다는 것이다.

total_bill     16.99
tip             1.01
sex           Female
smoker            No
day              Sun
time          Dinner
size               2
Name: 0, dtype: object

In [18]:
#1, 3, 5 인덱스의 데이터를 한꺼번에 가져오기
tips.loc[[1,5]]

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3
5       25.29  4.71  Male     No  Sun  Dinner     4

#### 2) 행번호 읽기

In [ ]:
#데이터 프레임에서 0번째 행 데이터 추출
tips.iloc[0]

total_bill     16.99
tip             1.01
sex           Female
smoker            No
day              Sun
time          Dinner
size               2
Name: 0, dtype: object

In [ ]:
 #-1을 사용하여 마지막 행 데이터를 추출한 예제
tips.iloc[-1]

#### 3) 특정 행 범위 영역을 선택

In [ ]:
# tips[0:3]라고 하면 0, 1, 2번째 행을 출력합니다. 데이터프레임의 첫 번째 행을 0번째 행이라고 가정하며 
# [0:3]이라고 입력했지만 3번째 행을 가져오지 않음에 유의하세요.
tips[0:3]

In [ ]:
tips.iloc[0:3]

In [ ]:
tips.loc[0:3]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2

In [ ]:
tips.loc[0:3,['sex','day']] # 4개의 데이터를 찍고 그 중에서 원래 컬럼 속성이 7개인데 성별이랑 요일만 빼와라.

      sex  day
0  Female  Sun
1    Male  Sun
2    Male  Sun
3    Male  Sun

In [ ]:
tips.loc[0,['sex','day']]

      sex  day
0  Female  Sun
1    Male  Sun

In [ ]:
#특정 인덱스 값과 특정 컬럼에 있는 값 가져오기. 
#.at을 이용할 수도 있습니다. 

tips.at[0,'sex']

In [38]:
# 위치를 이용하여 선택하기: .iloc
tips.iloc[3]

total_bill     23.68
tip             3.31
sex             Male
smoker            No
day              Sun
time          Dinner
size               2
Name: 3, dtype: object

In [29]:
#인덱스 번호로 행뿐만 아니라 열도 선택할 수 있습니다. 

tips.iloc[3:5,0:2]

   total_bill   tip
3       23.68  3.31
4       24.59  3.61

In [ ]:
#행과 열의 인덱스를 리스트로 넘겨줄 수도 있습니다. 
tips.iloc[[1,2,4],[0,2]]

In [ ]:
# 명시적으로 행이나 열 선택 인자에 ‘:’ 슬라이스를 전달하면 
tips.iloc[1:3,:]

In [ ]:
tips.iloc[:,1:3]

In [ ]:
#값 하나를 선택하기 위해서는 특정 행과 열을 지정
tips.iloc[1,1]

In [ ]:
tips.iat[1,1]

### 4) 조건을 이용하여 선택

In [ ]:
# 조건은 컬럼 데이터를 조건식과 비교하여 데이터를 추출하는 데이터베이스 SQL과 유사합니다
# 전체 데이터중 팁이 5 달러 이상 #tips.tip > 5 그냥 이렇게 쓸 수 있는데 이건 true와 false로 보여진다.
tips[tips.tip > 5]

     total_bill    tip     sex smoker   day    time  size
23        39.42   7.58    Male     No   Sat  Dinner     4
44        30.40   5.60    Male     No   Sun  Dinner     4
47        32.40   6.00    Male     No   Sun  Dinner     4
52        34.81   5.20  Female     No   Sun  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
85        34.83   5.17  Female     No  Thur   Lunch     4
88        24.71   5.85    Male     No  Thur   Lunch     2
116       29.93   5.07    Male     No   Sun  Dinner     4
141       34.30   6.70    Male     No  Thur   Lunch     6
155       29.85   5.14  Female     No   Sun  Dinner     5
170       50.81  10.00    Male    Yes   Sat  Dinner     3
172        7.25   5.15    Male    Yes   Sun  Dinner     2
181       23.33   5.65    Male    Yes   Sun  Dinner     2
183       23.17   6.50    Male    Yes   Sun  Dinner     4
211       25.89   5.16    Male    Yes   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
214       28.17   6.50  Female    Yes   Sat  Dinner     3
239       29.03   5.92    Male     No   Sat  Dinner     3

In [ ]:
# and 조건 – 남자 손님이면서 비흡연자
tips[(tips['sex']=='Male') & (tips['smoker']=='No')]

### 5) 특정 조건 선택

In [45]:
# 특정조건 선택시 ‘isin’ 함수(논리 연산)를 많이 사용합니다. 
# 일요일 이면 True
[tips['day'].isin(['Sun'])]

[0       True
 1       True
 2       True
 3       True
 4       True
        ...
 239    False
 240    False
 241    False
 242    False
 243    False
 Name: day, Length: 244, dtype: bool]

In [ ]:
# 팁을 1달러 지불한 고객
tips[tips['tip'].isin([1])]

Empty DataFrame
Columns: [total_bill, tip, sex, smoker, day, time, size]
Index: []

### 열 변수

#### 1) 열변수 추출

In [53]:
#데이터프레임에서 tips과 손님수 가지고 오기
tips.tip[1]

np.float64(1.66)

In [ ]:
tips['size'] # 행 인덱스할 떄는 .으로 나타내도 지만 열은 인덱스하는 게 다르다.

0      2
1      3
2      3
3      2
4      4
      ..
239    3
240    2
241    2
242    2
243    2
Name: size, Length: 244, dtype: int64

#### 2) 여러 개 열 변수 한 번에 추출하기

In [28]:
#데이터프레임 'total_bill ', 'tip', 'day' 열 변수 추출
tips [['total_bill','tip','day']]

     total_bill   tip   day
0         16.99  1.01   Sun
1         10.34  1.66   Sun
2         21.01  3.50   Sun
3         23.68  3.31   Sun
4         24.59  3.61   Sun
..          ...   ...   ...
239       29.03  5.92   Sat
240       27.18  2.00   Sat
241       22.67  2.00   Sat
242       17.82  1.75   Sat
243       18.78  3.00  Thur

[244 rows x 3 columns]

#### 3) 파생변수 만들기

In [ ]:
# 금액과 팁의 합계인 총액 (total)파생변수 만들기
tips['total'] = tips['total_bill'] + tips['tip']
tips['total']

#### 4) 열 데이터 자료형 확인 및 변환

In [ ]:
#데이터프레임 자료형 확인
tips.dtypes

In [ ]:
#데이터프레임 열의 자료형 확인
type(tips.total_bill)

In [ ]:
#데이터프레임 자료형 변환
#카테고리형의 흡연 유무를 문자열으로 변환하여 삽입
tips['smoker_str']=tips['smoker'].astype(str)
tips.dtypes

#### 주의 :  자료형 중 카테고리형(category)과 문자열(object)의 차이

In [ ]:
tips.info()

In [ ]:
tips['smoker_str'] =tips['smoker'].astype('category')
tips.info()

### 데이터조작

#### 1)데이터 개수확인

In [ ]:
#데이터프레임의 개수 확인 
tips.count( )

In [ ]:
len(tips)

#### 2) 기타 보기

In [ ]:
# 데이터프레임 인덱스 보기
tips.index

In [ ]:
# 데이터프레임 컬럼 보기
tips.columns

In [ ]:
# 행, 열 구조 보기 
tips.values

#### 3) 정렬

In [ ]:
# 지급액'열(by=' total_bill ')을 기준으로 index(axis=0) 오름차순 정렬하기
tips.sort_values(by=['total_bill'], axis=0)

In [ ]:
# 지급액'열(by=' total_bill ')을 기준으로 index(axis=0) 내림차순 정렬하기 ascending=False 옵션 추가 
tips.sort_values(by=['total_bill'], axis=0, ascending=False)

In [ ]:
#열 이름을 (알파벳 순서로) 정렬하기 : axis=1
tips.sort_index(axis=1)

#### 4) 행/열 합계

In [ ]:
# 행 합계를 구할 때는 sum(axis=1) 메서드를 사용한다.
tips.sum(axis=1)

In [ ]:
# 열 합계를 구할 때는 sum(axis=0) 메서드를 사용하는데 axis인수의 디폴트 값이 0이므로 axis인수를 생략할 수 있다.
tips.sum()

## 4. 데이터 병합과 연결

### 데이터 연결

In [ ]:
import pandas as pd

# 시리즈를 데이터프레임의 새로운 행으로 연결하려면
s1 = pd.Series([0, 1], index=['A', 'B'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
print(s1)
print(s2)
print(pd.concat([s1, s2]))

In [ ]:
#만약 옆으로 데이터 열을 연결하고 싶으면 axis=1로 인수를 설정한다.
df1 = pd.DataFrame([['Dog','3'], ['Bird','10'], ['Tiger','6'], ['Moose','3']],
                  index = ['0','1','2','3'],
                  columns = ['동물','나이'])
df1

In [ ]:
df2 = pd.DataFrame([['집','0'], ['초원','0'], ['수풀','0'], ['초원','1']],
                  index = ['0','1','2','3'],
                  columns = ['사는곳','뿔의 개수'])
df2

In [ ]:
pd.concat([df1, df2], axis=1)

### 데이터 병합

In [56]:
import pandas as pd

# 병합용 데이터프레임 생성
df1 = pd.DataFrame({ '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['강감찬', '홍길동', '이순신', '장보고', '유관순', '신사임당', '세종대왕']
}, columns=['고객번호', '이름'])
df1

   고객번호    이름
0  1001   강감찬
1  1002   홍길동
2  1003   이순신
3  1004   장보고
4  1005   유관순
5  1006  신사임당
6  1007  세종대왕

In [57]:
df2 = pd.DataFrame({'고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [58]:
# inner join
pd.merge(df1, df2)

   고객번호    이름     금액
0  1001   강감찬  10000
1  1001   강감찬  20000
2  1001   강감찬  30000
3  1005   유관순  15000
4  1006  신사임당   5000

In [59]:
# Full join 방식은 키 값이 한쪽에만 있어도 데이터를 보여준다.
pd.merge(df1, df2, how='outer')

   고객번호    이름        금액
0  1001   강감찬   10000.0
1  1001   강감찬   20000.0
2  1001   강감찬   30000.0
3  1002   홍길동       NaN
4  1003   이순신       NaN
5  1004   장보고       NaN
6  1005   유관순   15000.0
7  1006  신사임당    5000.0
8  1007  세종대왕       NaN
9  1008   NaN  100000.0

In [60]:
# left, right 방식은 각각 첫번째, 혹은 두번째 데이터프레임의 키 값을 모두 보여준다.
pd.merge(df1, df2, how='left')

   고객번호    이름       금액
0  1001   강감찬  10000.0
1  1001   강감찬  20000.0
2  1001   강감찬  30000.0
3  1002   홍길동      NaN
4  1003   이순신      NaN
5  1004   장보고      NaN
6  1005   유관순  15000.0
7  1006  신사임당   5000.0
8  1007  세종대왕      NaN

In [62]:
pd.merge(df1, df2, how='right')

   고객번호    이름      금액
0  1001   강감찬   10000
1  1001   강감찬   20000
2  1005   유관순   15000
3  1006  신사임당    5000
4  1008   NaN  100000
5  1001   강감찬   30000

## 5. 단일변수 데이터 보기

### 범주형

In [63]:
# 관련 라이브러리 불러오기
import pandas as pd           #판다스
import seaborn as sns          #시본 

#데이터 준비 
tips = sns.load_dataset("tips")    # 팁 데이터

#데이터 보기
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [64]:
# 성별 범주형 빈도분석
tips['sex'].value_counts()

sex
Male      157
Female     87
Name: count, dtype: int64

In [65]:
# 요일별 범주형 빈도분석
tips['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

### 연속형

In [66]:
# tips 데이터 유형 확인 
# tips 데이터의 범주형(category) 변수는 sex,smoker,day,time 4개 
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [67]:
# float에 대한 기술통계
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [79]:
tips

num = tips['sex'].value_counts()
# num = info()
print("남자: %d명, 여자: %d명" %(num['Male'], num['Female']))


print('합: ', tips['tip'].groupby(tips['sex']).sum())
print('민값: ',tips['tip'].groupby(tips['sex']).mean())

# 요일별 팁 액수 출력하기
#
#
#

tips['tip_prop'] = print('비율: ', tips['tip']/tips['total_bill'] * 100)

tips

# 성별 팁 비율 계산하기, 시험문제로 나올 수 있다.
tips['tip_prop'] = print('비율: ', tips['tip']/tips['total_bill'] * 100)
print('성별 팁 비율율: ',tips['tip'].groupby(tips['sex']).mean())

# 요일별 팁 비율 계산하기

남자: 157명, 여자: 87명
합:  sex
Male      485.07
Female    246.51
Name: tip, dtype: float64
민값:  sex
Male      3.089618
Female    2.833448
Name: tip, dtype: float64
비율:  0       5.944673
1      16.054159
2      16.658734
3      13.978041
4      14.680765
         ...
239    20.392697
240     7.358352
241     8.822232
242     9.820426
243    15.974441
Length: 244, dtype: float64
비율:  0       5.944673
1      16.054159
2      16.658734
3      13.978041
4      14.680765
         ...
239    20.392697
240     7.358352
241     8.822232
242     9.820426
243    15.974441
Length: 244, dtype: float64
성별 팁 비율율:  sex
Male      3.089618
Female    2.833448
Name: tip, dtype: float64

C:\Users\minsu\AppData\Local\Temp\ipykernel_26688\1237992082.py:8: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print('합: ', tips['tip'].groupby(tips['sex']).sum())
C:\Users\minsu\AppData\Local\Temp\ipykernel_26688\1237992082.py:9: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print('민값: ',tips['tip'].groupby(tips['sex']).mean())
C:\Users\minsu\AppData\Local\Temp\ipykernel_26688\1237992082.py:22: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print('성별 팁 비율율: ',tips['tip'].groupby(tips['sex']).mean())

In [86]:
# 남녀 나눠서 데이터 처리

man = tips[tips['sex' ]== 'Male']
woman = tips[tips['sex' ]== 'Female']
man.info()
man['tip'].sum()

# 남성 평균 팁
print('man average', man['tip'].mean())

# 여성 평균 팁
print('woman average', woman['tip'].mean())

<class 'pandas.core.frame.DataFrame'>
Index: 157 entries, 1 to 242
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  157 non-null    float64
 1   tip         157 non-null    float64
 2   sex         157 non-null    category
 3   smoker      157 non-null    category
 4   day         157 non-null    category
 5   time        157 non-null    category
 6   size        157 non-null    int64
 7   tip_prop    0 non-null      object
dtypes: category(4), float64(2), int64(1), object(1)
memory usage: 7.3+ KB
man average 3.0896178343949043
woman average 2.8334482758620685

In [95]:
import pandas as pd

reservation = pd.read_excel('reservation.xlsx')
orderInfo = pd.read_excel('order_info.xlsx')

# 2 개의 데이터프레임을 합치기

a = pd.merge(reservation, orderInfo)
a

# 합친 데이터를 액셀파일로 만들기
a.to_excel('merged_data.xlsx', index=False)
# customer 별 매출 계산하기
customer_sales = a.groupby('CUSTOMER_ID')['SALES'].sum().reset_index()
print(customer_sales)
# 브랜치별 매출 계산하기
branch_sales = a.groupby('BRANCH')['SALES'].sum().reset_index()
print(branch_sales)

    CUSTOMER_ID   SALES
0      W1340463  120000
1      W1340464   36000
2      W1340465   36000
3      W1340466   36000
4      W1340467  144000
..          ...     ...
170    W1346675   36000
171    W1346676   48000
172    W1346677   75000
173    W1346678   17000
174    W1346679   24000

[175 rows x 2 columns]
   BRANCH    SALES
0      강남  2772000
1      강동   721000
2      강북   508000
3      강서   629000
4      관악   412000
5      광진   310000
6      구로   606000
7      금천   349000
8      노원   134000
9      도봉   202000
10    동대문   537000
11     동작   439000
12     마포   414000
13    서대문   859000
14     서초  1169000
15     성동   432000
16     성북    58000
17     송파  1004000
18     양천   408000
19    영등포  1178000
20     용산   708000
21     은평   417000
22     종로   424000
23     중구   427000
24     중랑   188000